request.xml.hbs

<?xml version="1.0" encoding="UTF-8"?>

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<EnquiryRequest xmlns="{{config.action}}">
			<Authentication>
				<SubscriberDetails>
					<CustomerCode>{{config.customer}}</CustomerCode>
					<Initials>{{config.initials}}</Initials>
					<Password>{{config.password}}</Password>
				</SubscriberDetails>
			</Authentication>

			<Request>
				<Asset>
                    {{#each query}}
					    <{{@key}}>{{this}}</{{@key}}>
                    {{/each}}
				</Asset>

				<PrimaryProduct>
					<Code>{{config.product}}</Code>
				</PrimaryProduct>

				{{#each config.supplementaryProducts}}
					<SupplementaryProduct>
						<Code>{{this}}</Code>
					</SupplementaryProduct>
				{{/each}}
			</Request>
		</EnquiryRequest>
	</soap:Body>
</soap:Envelope>
